tests/artillery.yaml
config:
  target: "ws://localhost:4567/api/v1/channels"
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 100
  variables:
    channelId: "742fc7fe-1527-4184-8945-10b30bf01347"

scenarios:
  - engine: ws
    name: Massive Test with Random Messages
    flow:
      - connect: "{{ target }}/{{ channelId }}"
      - loop:
          - send:
              data: '{ "message": "{{ randomString() }}" }'
          - think: 1
        count: 1000 # Each virtual user will send 1000 messages

  - engine: ws
    name: Receive Messages
    flow:
      - connect: "{{ target }}/{{ channelId }}"
      - loop:
          - receive:
              match: ".*"
          - think: 1
        count: 1000 # Each virtual user will receive 1000 messages

plugins:
  random:
    - function: randomString
      args:
        length: 10